{"medicine_name": "Aciloc 150 Tablet", "manufacturer": "Cadila Pharmaceuticals Ltd", "composition": ["Ranitidine (150mg)"], "introduction": ["Aciloc 150 Tablet is a medicine that reduces the amount of acid your stomach makes. It is used to treat and prevent heartburn, indigestion, and other symptoms caused by too much acid in the stomach. It is also used to treat and prevent stomach ulcers, reflux disease, and some rarer conditions.", "Aciloc 150 Tablet is also commonly prescribed to prevent stomach ulcers and heartburn seen with the use of painkillers. The medicine must be taken in dose and duration as prescribed by the doctor. How much you need, and how often you take it, will depend on what you are being treated for. Follow the advice of your doctor. This medicine should relieve indigestion and heartburn within a few hours and you may only need to take it for a short time when you have symptoms. If you are taking it to prevent ulcers and other conditions you may need to take it for longer. You should keep taking it regularly to prevent problems from happening in the future. You may be able to help improve your symptoms by eating smaller meals more often and avoiding spicy or fatty foods.", "Most people who take it do not have any side effects but the most common include headache, constipation, feeling drowsy or tired, and diarrhea. If you do get a side effect, it is usually mild and will go away when you stop taking this medicine or as you adjust to it. Consult your doctor if any of these side effects bother you or do not go away.", "Before taking it, you should tell your doctor if you have any kidney or liver problems. This may affect the dose or suitability of this medicine. Also tell your doctor what other medicines you are taking as some may affect, or be affected by, this medicine. This medicine is usually considered safe to take during pregnancy and breastfeeding if it has been prescribed by a doctor. Avoid drinking alcohol as this can increase the amount of acid in your stomach and make your symptoms worse."], "uses": ["Treatment of Gastroesophageal reflux disease (Acid reflux)", "Treatment of Peptic ulcer disease"], "side_effects": ["Headache", "Diarrhea", "Gastrointestinal disturbance"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Aciloc 150 Tablet may be taken with or without food, but it is better to take it at a fixed time.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Aciloc 150 Tablet.", "Pregnancy": "Aciloc 150 Tablet is generally considered safe to use during pregnancy. Animal studies have shown low or no adverse effects to the developing baby; however, there are limited human studies.", "Breast feeding": "Aciloc 150 Tablet is probably safe to use during breastfeeding. Limited human data suggests that the drug does not represent any significant risk to the baby.", "Driving": "Aciloc 150 Tablet does not usually affect your ability to drive.", "Kidney": "Aciloc 150 Tablet should be used with caution in patients with kidney disease. Dose adjustment of Aciloc 150 Tablet may be needed. Please consult your doctor.", "Liver": "Aciloc 150 Tablet should be used with caution in patients with liver disease. Dose adjustment of Aciloc 150 Tablet may be needed. Please consult your doctor."}, "substitute": {"Udidine 150mg Tablet": "Universal Drug House Pvt Ltd", "Ranicom 150mg Tablet": "Comed Chemicals Ltd", "Bintac 150mg Tablet": "Biochem Pharmaceutical Industries", "Rintin 150mg Tablet": "Radicura Pharma pvt ltd", "Ulcirid 150mg Tablet": "Torrent Pharmaceuticals Ltd"}}