{"medicine_name": "Amlokind-AT Tablet", "manufacturer": "Mankind Pharma Ltd", "composition": ["Amlodipine (5mg)", "Atenolol (50mg)"], "introduction": ["Amlokind-AT Tablet is used to treat hypertension (high blood pressure). This is a combination of two medicines that controls blood pressure when a single medication is not effective. It helps to lower high blood pressure and thus reduces the chances of future heart attack and stroke.", "You can take Amlokind-AT Tablet at any time of day, on empty stomach, but it is best to take it at the same time each day. Keep taking it for as long as advised by your doctor. Even if you feel well, do not stop this medicine on your own because high blood pressure often has no symptoms. If you stop taking it, your condition may get worse. Keeping active with regular exercise, reducing your weight and eating a healthy diet will also help control your blood pressure. Follow your doctor’s advice while taking this medicine.", "It may cause side effects like headache, ankle swelling, slow heart rate, and nausea. It may also cause dizziness, so do not drive or do anything that requires mental focus until you know how this medicine affects you. This might raise the level of potassium in the blood, hence avoid potassium rich food or supplements. You may be asked for regular monitoring of blood pressure, kidney function, and electrolytes level while on the treatment.", "Before taking it, let your doctor know if you have any liver or kidney problems. Pregnant or breastfeeding women should also consult their doctor for advice before taking this medicine. You also need to tell your doctor what other medicines you are taking especially those used to treat high blood pressure or heart conditions."], "uses": ["Treatment of Hypertension (high blood pressure)"], "side_effects": ["Sleepiness", "Headache", "Ankle swelling", "Flushing (sense of warmth in the face, ears, neck and trunk)", "Slow heart rate", "Palpitations", "Nausea", "Edema (swelling)", "Constipation", "Tiredness", "Cold extremities"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Amlokind-AT Tablet is to be taken empty stomach.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Amlokind-AT Tablet.", "Pregnancy": "Amlokind-AT Tablet is unsafe to use during pregnancy as there is definite evidence of risk to the developing baby. However, the doctor may rarely prescribe it in some life-threatening situations if the benefits are more than the potential risks. Please consult your doctor.", "Breast feeding": "Amlokind-AT Tablet is probably unsafe to use during breastfeeding. Limited human data suggests that the drug may pass into the breastmilk and harm the baby.", "Driving": "Amlokind-AT Tablet may cause side effects which could affect your ability to drive.\nAmlokind-AT Tablet may cause side effects such as dizziness, headaches, nausea or tiredness, all of which could affect your ability to concentrate and drive.", "Kidney": "Amlokind-AT Tablet should be used with caution in patients with kidney disease. Dose adjustment of Amlokind-AT Tablet may be needed. Please consult your doctor.\nRegular monitoring of blood pressure is recommended and can help in better dose adjustment.", "Liver": "Amlokind-AT Tablet should be used with caution in patients with liver disease. Dose adjustment of Amlokind-AT Tablet may be needed. Please consult your doctor.\nAmlokind-AT Tablet is started at a lower dose in patients with liver disease and further increased slowly with careful monitoring."}, "substitute": {"Lupidip-A Tablet": "Lupin Ltd", "Amlip AT Tablet": "Cipla Ltd", "Primodil-AT Tablet": "Medley Pharmaceuticals", "Amlovas-AT Tablet": "Macleods Pharmaceuticals Pvt Ltd", "Amlopin-AT Tablet": "USV Ltd"}}