{"medicine_name": "Dithimazin Fort Tablet", "manufacturer": "Onamoy Healthcare LLP", "composition": ["Diethylcarbamazine (250mg)", "Chlorpheniramine Maleate (5mg)"], "introduction": ["Dithimazin Fort Tablet is a combination of two medicines used to treat parasites and worm infestations in the body. It helps to treat the infection by inhibiting the growth of the parasites.", "Dithimazin Fort Tablet is a prescription medicine. It is advised to take it as a prescription. It should be taken with food, but it must be taken at a fixed time to ensure better efficacy. Do not consume more than the recommended dose, as this may have harmful effects on your body. If you miss a dose, take it as soon as you remember. The treatment must be completed even if you feel better.", "Dithimazin Fort Tablet may lead to some side effects such as nausea, headaches, stomach pain, etc. To overcome any such side effects, it is advised to eat a healthy balanced diet and drink plenty of fluid. If any of the side effects get aggravated, contact your doctor immediately. If you experience any allergic reaction (rashes, itching, swelling, shortness of breath, etc.), you must consult your doctor immediately.", "Before taking this medicine, you should tell your doctor if you are taking any medicines for any health condition. Pregnant or breastfeeding women should also consult with their doctor before taking it. Avoid drinking alcohol as it can cause excessive drowsiness with this medicine. It usually does not impair your ability to drive, but you should not drive if it makes you feel sleepy or dizzy."], "uses": ["Parasitic infections"], "side_effects": ["Nausea", "Loss of appetite", "Sleepiness", "Headache", "Allergic reaction"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Dithimazin Fort Tablet is to be taken with food.", "safety_advice": {"Alcohol": "Dithimazin Fort Tablet may cause excessive drowsiness with alcohol.", "Pregnancy": "Information regarding the use of Dithimazin Fort Tablet during pregnancy is not available. Please consult your doctor.", "Breast feeding": "Information regarding the use of Dithimazin Fort Tablet during breastfeeding is not available. Please consult your doctor.", "Driving": "Dithimazin Fort Tablet may decrease alertness, affect your vision or make you feel sleepy and dizzy. Do not drive if these symptoms occur.", "Kidney": "Dithimazin Fort Tablet is probably safe to use in patients with kidney disease. Limited data available suggests that dose adjustment of Dithimazin Fort Tablet may not be needed in these patients. Please consult your doctor.\nUse of Dithimazin Fort Tablet may cause excessive sleepiness in patients with end stage kidney disease.", "Liver": "There is limited information available on the use of Dithimazin Fort Tablet in patients with liver disease. Please consult your doctor."}, "substitute": {"Carbarem Forte 250mg/5mg Tablet": "Suzikem Drugs Pvt Ltd", "Pavlozide 250mg/5mg Tablet": "Pavlola India Laboratories", "Unicarbazan Forte Tablet": "Torrent Pharmaceuticals Ltd", "Delcar Forte 250 mg/5 mg Tablet": "Ashok Pharmaceuticals"}}