{"medicine_name": "Dolo 650 Tablet", "manufacturer": "Micro Labs Ltd", "composition": ["Paracetamol (650mg)"], "introduction": ["Dolo 650 Tablet helps relieve pain and fever by blocking the release of certain chemical messengers responsible for fever and pain. It is used to treat headaches, migraine, toothaches, sore throats, period (menstrual) pains, arthritis, muscle aches, and the common cold.", "Dolo 650 Tablet has been one of the most widely prescribed paracetamol-based medications during the COVID-19 pandemic. It should be taken regularly as per the doctor’s advice. Take it with food to avoid an upset stomach. It may be taken alone or in combination with other medications. However, no more than four doses of Dolo 650 Tablet can be taken in 24 hours with a gap of at least 4 hours between two doses. Please do not take it for longer than recommended.", "Generally, Dolo 650 Tablet is well tolerated, and side effects are rare. However, it may temporarily cause stomach pain, nausea, and vomiting in some people. Consult the doctor if any of these side effects persist or become bothersome.", "Though Dolo 650 Tablet is essentially safe, it may not suit everyone. Before taking this medicine, let the doctor know if you have any liver or kidney problems, are allergic to it, or are taking other medications as this might affect the dose or suitability of the medicine. In general, take the lowest dose that works for the shortest possible time. It is also the first choice of painkillers during pregnancy or breastfeeding."], "uses": ["Pain relief", "Treatment of Fever"], "side_effects": ["Stomach pain", "Nausea", "Vomiting"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Dolo 650 Tablet is to be taken with food.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Dolo 650 Tablet.", "Pregnancy": "Dolo 650 Tablet may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.", "Breast feeding": "Dolo 650 Tablet is safe to use during breastfeeding. Human studies suggest that the drug does not pass into the breastmilk in a significant amount and is not harmful to the baby.", "Driving": "Dolo 650 Tablet does not usually affect your ability to drive.", "Kidney": "Dolo 650 Tablet should be used with caution in patients with kidney disease. Dose adjustment of Dolo 650 Tablet may be needed. Please consult your doctor.\nHowever, Dolo 650 Tablet contains paracetamol which is considered the safest painkiller for kidney disease patients.", "Liver": "Dolo 650 Tablet should be used with caution in patients with liver disease. Dose adjustment of Dolo 650 Tablet may be needed. Please consult your doctor.\nHowever, the use of Dolo 650 Tablet is not recommended in patients with severe liver disease and active liver disease."}, "substitute": {"Welset 650 Tablet": "Sun Pharmaceutical Industries Ltd", "Paracip 650 Tablet": "Cipla Ltd", "PUC 650 Tablet": "Alkem Laboratories Ltd", "XTPara 650mg Tablet": "Torrent Pharmaceuticals Ltd", "Pacimol 650 Tablet": "Ipca Laboratories Ltd"}}