{"medicine_name": "Flexon 650 Tablet", "manufacturer": "Aristo Pharmaceuticals Pvt Ltd", "composition": ["Paracetamol (650mg)"], "introduction": ["Flexon 650 Tablet helps relieve pain and fever by blocking the release of certain chemical messengers responsible for fever and pain. It is used to treat headaches, migraine, toothaches, sore throats, period (menstrual) pains, arthritis, muscle aches, and the common cold.", "Flexon 650 Tablet may be prescribed alone or in combination with another medicine. You should take it regularly as advised by your doctor. It is usually best taken with food otherwise it may upset your stomach. Do not take more or use it for longer than recommended.", "Side effects are rare if this medicine is used correctly but it may cause stomach pain, nausea, and vomiting in some people. Consult your doctor if any of these side effects bother you or do not go away.", "Flexon 650 Tablet is widely prescribed and considered safe but is not suitable for everybody. Before taking it, let your doctor know if you have liver or kidney problems or are using blood-thinning medicines. It may affect the dose or suitability of this medicine. Let your doctor know about all the other medicines you are taking because they may affect, or be affected by, this medicine."], "uses": ["Pain relief", "Treatment of Fever"], "side_effects": ["Stomach pain", "Nausea", "Vomiting"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Flexon 650 Tablet is to be taken with food.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Flexon 650 Tablet.", "Pregnancy": "Flexon 650 Tablet may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.", "Breast feeding": "Flexon 650 Tablet is safe to use during breastfeeding. Human studies suggest that the drug does not pass into the breastmilk in a significant amount and is not harmful to the baby.", "Driving": "Flexon 650 Tablet does not usually affect your ability to drive.", "Kidney": "Flexon 650 Tablet should be used with caution in patients with kidney disease. Dose adjustment of Flexon 650 Tablet may be needed. Please consult your doctor.\nHowever, Flexon 650 Tablet contains paracetamol which is considered the safest painkiller for kidney disease patients.", "Liver": "Flexon 650 Tablet should be used with caution in patients with liver disease. Dose adjustment of Flexon 650 Tablet may be needed. Please consult your doctor.\nHowever, the use of Flexon 650 Tablet is not recommended in patients with severe liver disease and active liver disease."}, "substitute": {"A Mol 650mg Tablet": "Aan Pharma Pvt Ltd", "Welset 650 Tablet": "Sun Pharmaceutical Industries Ltd", "Paracip 650 Tablet": "Cipla Ltd", "PUC 650 Tablet": "Alkem Laboratories Ltd", "P 650 Tablet": "Apex Laboratories Pvt Ltd"}}