{"medicine_name": "Glycomet 500 SR Tablet", "manufacturer": "USV Ltd", "composition": ["Metformin (500mg)"], "introduction": ["Glycomet 500 SR Tablet is a medicine used to treat type 2 diabetes mellitus. It helps control blood sugar levels and thus prevent serious complications of diabetes. It is also used to treat a menstruation-related disorder known as Polycystic ovary syndrome (PCOS) in women.", "Glycomet 500 SR Tablet is best taken with food to avoid nausea and abdominal pain. You should take it regularly, at the same time each day, to get the most benefit. You should not stop taking this medicine unless your doctor recommends it. Your lifestyle plays a big part in controlling diabetes. Therefore, it is important to stay on the diet and exercise program recommended by your doctor while taking this medicine. ", "The most common side effects of this medicine include nausea, vomiting, taste change, diarrhea, abdominal pain, and loss of appetite. Some people may develop hypoglycemia (low blood sugar level) when this medicine is taken along with other antidiabetic medicines, alcohol, or upon skipping a meal. Monitor your blood sugar levels regularly while taking it.", "Before taking this medicine, inform your doctor if you have any kidney, liver, or heart problems. Pregnant or breastfeeding women should also consult their doctor before taking it. Your doctor will check your kidney function tests before starting treatment with it. Avoid excessive alcohol intake while taking it as this may increase the risk of developing some side effects."], "uses": ["Treatment of Type 2 diabetes mellitus"], "side_effects": ["Diarrhea", "Nausea", "Vomiting", "Flatulence"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Glycomet 500 SR Tablet is to be taken with food.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Glycomet 500 SR Tablet.", "Pregnancy": "Glycomet 500 SR Tablet is generally considered safe to use during pregnancy. Animal studies have shown low or no adverse effects to the developing baby; however, there are limited human studies.", "Breast feeding": "Glycomet 500 SR Tablet should be used with caution during breastfeeding. Breastfeeding should be held until the treatment of the mother is completed and the drug is eliminated from her body.", "Driving": "Your ability to drive may be affected if your blood sugar is too low or too high. Do not drive if these symptoms occur.", "Kidney": "Glycomet 500 SR Tablet should be used with caution in patients with kidney disease. Dose adjustment of Glycomet 500 SR Tablet may be needed. Please consult your doctor.\nUse of Glycomet 500 SR Tablet is, however, not recommended in patients with severe kidney disease.", "Liver": "Glycomet 500 SR Tablet is probably unsafe to use in patients with liver disease and should be avoided. Please consult your doctor."}, "substitute": {"Metlong 500 Tablet SR": "Panacea Biotec Ltd", "Bigomet SR 500 Tablet": "Aristo Pharmaceuticals Pvt Ltd", "Scodia SR 500 Tablet": "Apex Laboratories Pvt Ltd", "Metsmall 500 Tablet SR": "Dr Reddy's Laboratories Ltd", "Zomet SR Tablet": "Intas Pharmaceuticals Ltd"}}