{"medicine_name": "Meftal-Spas Tablet", "manufacturer": "Blue Cross Laboratories Ltd", "composition": ["Dicyclomine (10mg)", "Mefenamic Acid (250mg)"], "introduction": ["Meftal-Spas Tablet is a prescription medicine that helps to provide symptomatic relief from menstrual (period-related) pain and cramps. It is also used to treat abdominal pain by relieving spasms of the muscles in the stomach and intestines.", "Meftal-Spas Tablet should be taken with food. This will prevent you from getting an upset stomach. The dose and duration will depend on what you are using it for and how well it helps your symptoms. Use it regularly and do not discontinue using it until the doctor tells you.", "It may cause some common side effects like dizziness, dryness in the mouth, blurred vision, nausea, and sleepiness. If you experience any of such side effects that do not go away or get worse, you should let your doctor know. Your doctor may be able to suggest ways of preventing or reducing the side effects. In general, you should try to use the smallest amount necessary to control your symptoms.", "Before using the medicine, you should tell your doctor if you have any kidney or liver problems, or if you are taking any other medicines. Pregnant and breastfeeding women should also consult their doctors before using the medicine."], "uses": ["Treatment of Menstrual pain", "Treatment of Abdominal cramp"], "side_effects": ["Dizziness", "Dryness in mouth", "Blurred vision", "Nausea", "Sleepiness", "Weakness", "Nervousness"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Meftal-Spas Tablet is to be taken with food.", "safety_advice": {"Alcohol": "Caution is advised when consuming alcohol with Meftal-Spas Tablet. Please consult your doctor.", "Pregnancy": "Information regarding the use of Meftal-Spas Tablet during pregnancy is not available. Please consult your doctor.", "Breast feeding": "Information regarding the use of Meftal-Spas Tablet during breastfeeding is not available. Please consult your doctor.", "Driving": "It is not known whether Meftal-Spas Tablet alters the ability to drive. Do not drive if you experience any symptoms that affect your ability to concentrate and react.", "Kidney": "Meftal-Spas Tablet should be used with caution in patients with kidney disease. Dose adjustment of Meftal-Spas Tablet may be needed. Please consult your doctor.\nUse of Meftal-Spas Tablet is not recommended in patients with severe kidney disease.", "Liver": "Meftal-Spas Tablet should be used with caution in patients with liver disease. Dose adjustment of Meftal-Spas Tablet may be needed. Please consult your doctor."}, "substitute": {"Spasmonil Plus Tablet": "Cipla Ltd", "Spastone Tablet": "Leeford Healthcare Ltd", "Anglospas Forte 10 mg/250 mg Tablet": "Anglo-French Drugs & Industries Ltd", "Mefnic 10mg/250mg Tablet": "Fitwel Pharmaceuticals Private Limited", "Colimex MF Tablet": "Wallace Pharmaceuticals Pvt Ltd"}}