{"medicine_name": "Megaspas Tablet", "manufacturer": "MDC Pharmaceuticals Pvt Ltd", "composition": ["Dicyclomine (10mg)", "Paracetamol (325mg)", "Mefenamic Acid (250mg)"], "introduction": ["Megaspas Tablet is a combination medicine used in the treatment of abdominal cramps. It works effectively to reduce abdominal pain and cramps by relaxing the muscles of the stomach and gut. It also blocks certain chemical messengers that cause pain and fever.", "Megaspas Tablet is taken with food in a dose and duration as advised by the doctor. The dose you are given will depend on your condition and how you respond to the medicine. You should keep taking this medicine for as long as your doctor recommends. If you stop treatment too early your symptoms may come back and your condition may worsen. Let your healthcare team know about all other medications you are taking as some may affect, or be affected by this medicine.", "The most common side effects are nausea, vomiting, heartburn, loss of appetite, indigestion, dryness in mouth, blurred vision, weakness, diarrhea, and nervousness. Most of these are temporary and usually resolve with time. Contact your doctor straight away if you are at all concerned about any of these side effects. It may also cause sleepiness, so do not drive or do anything that requires mental focus until you know how this medicine affects you. Avoid drinking alcohol while taking this medicine as it can worsen your sleepiness.", "Before taking this medicine, you should tell your doctor if you are pregnant, planning pregnancy or breastfeeding. You should also tell your doctor if you have any kidney or liver diseases so that your doctor can prescribe a suitable dose for you."], "uses": ["Abdominal cramp"], "side_effects": ["Nausea", "Vomiting", "Indigestion", "Diarrhea", "Loss of appetite", "Sleepiness", "Weakness", "Nervousness", "Dryness in mouth", "Blurred vision", "Heartburn"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Megaspas Tablet is to be taken with food.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Megaspas Tablet.", "Pregnancy": "Megaspas Tablet may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.", "Breast feeding": "Megaspas Tablet is probably unsafe to use during breastfeeding. Limited human data suggests that the drug may pass into the breastmilk and harm the baby.", "Driving": "Megaspas Tablet may decrease alertness, affect your vision or make you feel sleepy and dizzy. Do not drive if these symptoms occur.", "Kidney": "Megaspas Tablet should be used with caution in patients with kidney disease. Dose adjustment of Megaspas Tablet may be needed. Please consult your doctor.\nUse of Megaspas Tablet is not recommended in patients with severe kidney disease.", "Liver": "Megaspas Tablet should be used with caution in patients with liver disease. Dose adjustment of Megaspas Tablet may be needed. Please consult your doctor."}, "substitute": {"Mefen Spas Tablet": "Oyster Labs Ltd", "Decramp 10mg/325mg/250mg Tablet": "Benmed Pharmaceuticals", "Mefamol 10mg/325mg/250mg Tablet": "Rasco Life Sciences Pvt Ltd", "Pack 10mg/325mg/250mg Tablet": "Evans Pharma", "Colifine 10mg/325mg/250mg Tablet": "Invision Medi Sciences Pvt Ltd"}}