{"medicine_name": "Megapen Capsule", "manufacturer": "Aristo Pharmaceuticals Pvt Ltd", "composition": ["Ampicillin (250mg)", "Cloxacillin (250mg)"], "introduction": ["Megapen Capsule is a combination medicine that is used to treat various types of bacterial infections. It fights against the microorganisms to prevent their growth and further spread of the infection.", "Megapen Capsule is a prescription medicine. It is advised to take it as per the prescription. It can be taken with or without food, but it must be taken at a fixed time to ensure better efficacy. Do not consume more than the recommended dose, as this may have harmful effects on your body. If you miss a dose, take it as soon as you remember. The course of the treatment must be completed even if you feel better. Sudden discontinuation of the treatment may affect the potency of the medicine.", "Some common side effects of this medicine are nausea, vomiting, diarrhea, indigestion, etc. If any of the side effects get aggravated, you must consult your doctor immediately. If you experience any allergic reaction (rashes, itching, swelling, shortness of breath, etc.), you must seek immediate medical help.", "Before taking this medicine, you should tell your doctor if you are taking any medicines for any health condition. Pregnant or breastfeeding women should also consult with their doctor before taking it. Avoid drinking alcohol as it can cause excessive drowsiness with this medicine. It usually does not impair your ability to drive, but you should not drive if it makes you feel sleepy or dizzy. You must take adequate rest for a faster recovery, also take a healthy diet and drink plenty of water. Your doctor may ask for a few laboratory and diagnostic tests to know the effects of the medicine on your body."], "uses": ["Treatment of Bacterial infections"], "side_effects": ["Allergic reaction", "Rash", "Stomach pain", "Nausea", "Diarrhea"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Megapen Capsule may be taken with or without food, but it is better to take it at a fixed time.", "safety_advice": {"Alcohol": "Consuming alcohol with Megapen Capsule does not cause any harmful side effects.", "Pregnancy": "Megapen Capsule is generally considered safe to use during pregnancy. Animal studies have shown low or no adverse effects to the developing baby; however, there are limited human studies.", "Breast feeding": "Megapen Capsule is probably safe to use during breastfeeding. Limited human data suggests that the drug does not represent any significant risk to the baby.", "Driving": "Megapen Capsule does not usually affect your ability to drive.", "Kidney": "Megapen Capsule should be used with caution in patients with kidney disease. Dose adjustment of Megapen Capsule may be needed. Please consult your doctor.\nRegular monitoring of kidney function tests is advised while taking this medicine.", "Liver": "Megapen Capsule should be used with caution in patients with liver disease. Dose adjustment of Megapen Capsule may be needed. Please consult your doctor.\nRegular monitoring of liver function tests is advised while taking this medicine."}, "substitute": {"Cilclox 250mg/250mg Capsule": "DWD Pharmaceuticals Ltd", "Dynacil Plus 250mg/250mg Capsule": "Hindustan Antibiotics Ltd", "Mivon 250mg/250mg Capsule": "LA Grande Pvt Ltd", "AROCLOX 250MG/250MG CAPSULE": "Pharmasynth Formulations Ltd", "Danaclox 250mg/250mg Capsule": "Dana Pharmaceuticals Pvt Ltd"}}