{"medicine_name": "Metrogyl 400 Tablet", "manufacturer": "J B Chemicals and Pharmaceuticals Ltd", "composition": ["Metronidazole (400mg)"], "introduction": ["Metrogyl 400 Tablet is an antibiotic medicine that helps your body fight infections caused by bacteria and parasites. It is used to treat infections of the liver, stomach, intestines, vagina, brain, heart, lungs, bones, and skin.", "Metrogyl 400 Tablet helps prevent an infection after surgery. It is also used in the treatment of dental infections, leg ulcers, and pressure sores. This medicine is best taken after eating some food. It should be taken at the same time each day to get the most benefit. The amount you are advised will depend on what you are being treated for and how bad it is, but you should take this antibiotic exactly as prescribed by your doctor. Your symptoms may get better after a short time but do not stop taking it until you have finished a full course of treatment, even if you feel well. If you stop taking it early, some bacteria may survive, and the infection may come back. Do not drink alcohol while taking this medicine and for a few days after stopping it. Otherwise, you may get unpleasant side effects like nausea, vomiting, and stomach pain.", "The most common side effects of this medicine are headache, dryness in the mouth, nausea, and a slight metallic taste in the mouth. These are usually mild but let your doctor know if they bother you or last more than a few days. You can try using sugarless candies or lozenges to overcome any dryness or metallic taste in the mouth.", "Before using this medicine, inform your doctor if you are allergic to any medicine or have any kidney or liver problems or any disease of the nervous system. If you are pregnant or breastfeeding, inform your doctor before taking this medicine."], "uses": ["Treatment of Bacterial infections", "Treatment of Parasitic infections"], "side_effects": ["Headache", "Dryness in mouth", "Nausea", "Metallic taste"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Metrogyl 400 Tablet is to be taken with food.", "safety_advice": {"Alcohol": "Consuming alcohol while taking Metrogyl 400 Tablet may cause symptoms such as flushing, increased heart beat, nausea, thirst, chest pain and low blood pressure (Disulfiram reaction).", "Pregnancy": "Metrogyl 400 Tablet is generally considered safe to use during pregnancy. Animal studies have shown low or no adverse effects to the developing baby; however, there are limited human studies.", "Breast feeding": "Metrogyl 400 Tablet should be used with caution during breastfeeding. Breastfeeding should be held until the treatment of the mother is completed and the drug is eliminated from her body.\nIf a single dose of Metrogyl 400 Tablet is used, it is recommended to hold breastfeeding for 12-24 hours to allow the removal of the drug.", "Driving": "Metrogyl 400 Tablet may cause side effects which could affect your ability to drive.\nMetrogyl 400 Tablet may make you feel sleepy, dizzy, confused. You may have hallucinations, fits (convulsions) or temporary eyesight problems (such as blurred or double vision) affecting your ability to drive.", "Kidney": "Metrogyl 400 Tablet is safe to use in patients with kidney disease. No dose adjustment of Metrogyl 400 Tablet is recommended.\nPatients undergoing kidney dialysis should take this medicine after the dialysis treatment.", "Liver": "Metrogyl 400 Tablet should be used with caution in patients with liver disease. Dose adjustment of Metrogyl 400 Tablet may be needed. Please consult your doctor."}, "substitute": {"Metro 400mg Tablet": "Makers Laboratories Ltd", "Unimegyl 400mg Tablet": "Torrent Pharmaceuticals Ltd", "Metgyl 400mg Tablet": "Jagsonpal Pharmaceuticals Ltd", "Metropen 400mg Tablet": "Pfizer Ltd", "Metrocon 400mg Tablet": "Concept Pharmaceuticals Ltd"}}