{"medicine_name": "Monticope Suspension", "manufacturer": "Mankind Pharma Ltd", "composition": ["Levocetirizine (2.5mg/5ml)", "Montelukast (4mg/5ml)"], "introduction": ["Monticope Suspension is commonly prescribed in children to treat symptoms of allergy such as runny nose, sneezing, itching, swelling, congestion, and watery eyes. It may also help in the treatment of asthma and skin allergies.", "Give this medicine to your child at a fixed time before or after food in the prescribed dose, time, and way. For asthma, prefer giving Monticope Suspension in the evening or 2 hours before physical activity. For allergy, it is best to give it either in the morning or in the evening, depending upon the time of onset of symptoms. In case your child has both, prefer giving it in the evening. If your child vomits within 30 minutes of taking this medicine, give the same dose again, but skip it if it’s already time for the next dose.", "Your child may start to feel better after a few regular doses. However, you must still complete the prescribed dose to ensure maximum benefit. Moreover, stopping the medicine abruptly may worsen your child’s condition. This medicine may cause some minor and temporary side effects like vomiting, diarrhea, nausea, dizziness, dry mouth, rash, and headache. Usually, these episodes subside once your child’s body adapts to the medicine. However, in case these effects persist or start bothering your child, consult your child’s doctor without any delay.", "Let your child’s doctor know if your child is already taking any medicines. Also, narrate your child’s complete medical history, including any prior episodes of allergy, heart problem, blood disorder, vascular disorders, birth defects, airway obstruction, lung anomaly, skin disorder, liver impairment, and kidney malfunction. This information is critical for dose alterations and in planning your child’s overall treatment."], "uses": ["Treatment of Sneezing and runny nose due to allergies", "Treatment of Hay fever", "Treatment of Allergic skin conditions"], "side_effects": ["Rash", "Nausea", "Diarrhea", "Dryness in mouth", "Fatigue", "Headache", "Skin rash", "Sleepiness", "Vomiting"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Check the label for directions before use. Measure it with a measuring cup and take it by mouth. Shake well before use. Monticope Suspension may be taken with or without food, but it is better to take it at a fixed time.", "safety_advice": {"Kidney": "Monticope Suspension should be used with caution in patients with kidney disease. Dose adjustment of Monticope Suspension may be needed. Please consult your doctor.\nHowever, use of Monticope Suspension is not recommended in patients with severe kidney disease.", "Liver": "Monticope Suspension is safe to use in patients with liver disease. No dose adjustment of Monticope Suspension is recommended.\nMonticope Suspension is relatively safe to use in children. However, consult your child’s doctor in case of severe liver disease."}, "substitute": {"Vibmont L Oral Suspension": "Vibdrugs Biosciences", "Zycet M Oral Suspension": "Aelida Healthcare", "Lzet-M Kid Oral Suspension": "Doctomed", "Alrocet M Oral Suspension": "Alrosa Pharmaceuticals Pvt Ltd", "Lcetmax M Oral Suspension": "Betamax Remedies"}}