{"medicine_name": "Pantop-D SR Capsule", "manufacturer": "Aristo Pharmaceuticals Pvt Ltd", "composition": ["Domperidone (30mg)", "Pantoprazole (40mg)"], "introduction": ["Pantop-D SR Capsule is a prescription medicine used to treat gastroesophageal reflux disease (Acid reflux) and peptic ulcer disease by relieving the symptoms of acidity such as indigestion, heartburn, stomach pain, or irritation.", "Pantop-D SR Capsule also neutralizes the acid in the stomach and promotes easy passage of gas to reduce stomach discomfort. It is taken without food in a dose and duration as advised by the doctor. The dose you are given will depend on your condition and how you respond to the medicine. You should keep taking Pantop-D SR Capsule for as long as your doctor recommends. If you stop treatment too early your symptoms may come back and your condition may worsen. Let your healthcare team know about all other medications you are taking as some may affect, or be affected by this medicine.", "The most common side effects of Pantop-D SR Capsule are diarrhea, stomach pain, flatulence, dryness in the mouth, and headache. Most of these are temporary and usually resolve with time. Contact your doctor straight away if you are at all concerned about any of these side effects. This medicine may cause dizziness and sleepiness, so do not drive or do anything that requires mental focus until you know how this medicine affects you. Avoid drinking alcohol while taking Pantop-D SR Capsule as it can worsen your sleepiness. Lifestyle modifications like having cold milk and avoiding hot tea, coffee, spicy food, or chocolate can help you to get better results.", "Before you start taking this medicine it is important to inform your doctor if you are suffering from kidney or liver disease. You should also tell your doctor if you are pregnant, planning pregnancy, or breastfeeding."], "uses": ["Treatment of Gastroesophageal reflux disease (Acid reflux)", "Treatment of Peptic ulcer disease"], "side_effects": ["Diarrhea", "Stomach pain", "Flatulence", "Dryness in mouth", "Dizziness", "Headache"], "how_to_use": "Use it as advised by your doctor or check the label for directions before use. Pantop-D SR Capsule is to be taken empty stomach.", "safety_advice": {"Alcohol": "Caution is advised when consuming alcohol with Pantop-D SR Capsule. Please consult your doctor.", "Pregnancy": "Pantop-D SR Capsule may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.", "Breast feeding": "Pantop-D SR Capsule should be used with caution during breastfeeding. Breastfeeding should be held until the treatment of the mother is completed and the drug is eliminated from her body.", "Driving": "Pantop-D SR Capsule may decrease alertness, affect your vision or make you feel sleepy and dizzy. Do not drive if these symptoms occur.", "Kidney": "Pantop-D SR Capsule should be used with caution in patients with kidney disease. Dose adjustment of Pantop-D SR Capsule may be needed. Please consult your doctor.", "Liver": "Pantop-D SR Capsule is probably safe to use in patients with liver disease. Limited data available suggests that dose adjustment of Pantop-D SR Capsule may not be needed in these patients. Please consult your doctor."}, "substitute": {"Pentopan DSR Capsule PR": "Ozone Pharmaceuticals Ltd", "Padup Capsule PR": "Deys Medical", "Pantadom-SR Capsule": "Mankind Pharma Ltd", "Pantakind-DSR Capsule": "Mankind Pharma Ltd", "Jekocid-DSR Capsule": "Jk India Healthcare Pvt Ltd"}}