{"medicine_name": "Sinarest New Tablet", "manufacturer": "Centaur Pharmaceuticals Pvt Ltd", "composition": ["Chlorpheniramine Maleate (2mg)", "Paracetamol (500mg)", "Phenylephrine (10mg)"], "introduction": ["Sinarest New Tablet is a medicine used in the treatment of common cold symptoms. It provides relief from symptoms such as headache, sore throat, runny nose, muscular pain, and fever.", "Sinarest New Tablet can be taken with or without food. The dose and duration will depend on the severity of your condition. You should keep taking the medicine even if you feel better until the doctor says it is alright to stop using it.", "Using this medicine may cause a few common side effects such as nausea, vomiting, sleepiness, dizziness, and headache. If any of these side effects do not resolve with time or get worse, you should let your doctor know. Your doctor may be able to suggest ways of preventing or reducing the side effects. In general, you should try to use the smallest amount necessary to control your symptoms.", "Before using the medicine, you should tell your doctor if you have any other medical conditions or disorders. To make sure it is safe, you should let your doctor know all the other medicines you are taking. Also, tell your doctor if you have any problems with the liver or kidneys. Avoid consumption of alcohol while on treatment with this medicine as it may increase the chance of some side effects. Pregnant and breastfeeding women should consult their doctors first before using the medicine."], "uses": ["Treatment of Common cold"], "side_effects": ["Nausea", "Headache", "Insomnia (difficulty in sleeping)", "Dizziness", "Tachycardia", "Palpitations", "Fear", "Anxiety", "Restlessness", "Tremors", "Weakness", "Discomfort when urinating", "Hallucination", "Convulsion"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Sinarest New Tablet may be taken with or without food, but it is better to take it at a fixed time.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Sinarest New Tablet.", "Pregnancy": "Sinarest New Tablet may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.", "Breast feeding": "Sinarest New Tablet is probably safe to use during breastfeeding. Limited human data suggests that the drug does not represent any significant risk to the baby.", "Driving": "Sinarest New Tablet may decrease alertness, affect your vision or make you feel sleepy and dizzy. Do not drive if these symptoms occur.", "Kidney": "Sinarest New Tablet is probably safe to use in patients with kidney disease. Limited data available suggests that dose adjustment of Sinarest New Tablet may not be needed in these patients. Please consult your doctor.\nUse of Sinarest New Tablet may cause excessive sleepiness in patients with end stage kidney disease.", "Liver": "Sinarest New Tablet should be used with caution in patients with liver disease. Dose adjustment of Sinarest New Tablet may be needed. Please consult your doctor."}, "substitute": {"Nasoclear Cold Tablet": "Zydus Cadila", "Flucold Tablet": "Wallace Pharmaceuticals Pvt Ltd", "Wikoryl 10 Tablet": "Alembic Pharmaceuticals Ltd", "Lizovel Fort 2mg/500mg/10mg Tablet": "Vinson pharma", "Solvin Cold Tablet": "Ipca Laboratories Ltd"}}