{"medicine_name": "Vertin 16 Tablet", "manufacturer": "Abbott", "composition": ["Betahistine (16mg)"], "introduction": ["Vertin 16 Tablet is used to prevent and treat a disorder of the inner ear known as Ménière’s disease. The symptoms include dizziness (vertigo), ringing in the ears (tinnitus), and loss of hearing, probably caused by fluid in the ear. This medicine helps relieve the symptoms by reducing the amount of fluid.", "Vertin 16 Tablet should be swallowed whole with water and taken at the same time(s) each day to get the most benefit. Your doctor will decide what is the correct dose to relieve your symptoms and how often you need to take it. You may need to take this medicine for several months and you should take it for as long as prescribed by your doctor, even if you start feeling better. ", "The most common side effects include headache, feeling sick, and indigestion (dyspepsia). You may also get stomach pain and bloating. Taking the medicine with food can help reduce stomach problems.  ", "Before taking this medicine, you should talk to your doctor if you have a stomach ulcer, asthma, or high or low blood pressure. You must also tell him/her what other medicines you are taking, to make sure you are safe. Also speak to your doctor if you are pregnant, trying to become pregnant, or breastfeeding."], "uses": ["Treatment of Meniere's disease"], "side_effects": ["Headache", "Indigestion", "Nausea", "Stomach pain", "Bloating"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Vertin 16 Tablet may be taken with or without food, but it is better to take it at a fixed time.", "safety_advice": {"Alcohol": "Consuming alcohol with Vertin 16 Tablet does not cause any harmful side effects.", "Pregnancy": "Information regarding the use of Vertin 16 Tablet during pregnancy is not available. Please consult your doctor.", "Breast feeding": "Information regarding the use of Vertin 16 Tablet during breastfeeding is not available. Please consult your doctor.", "Driving": "Vertin 16 Tablet does not usually affect your ability to drive.", "Kidney": "Vertin 16 Tablet is probably safe to use in patients with kidney disease. Limited data available suggests that dose adjustment of Vertin 16 Tablet may not be needed in these patients. Please consult your doctor.", "Liver": "There is limited information available on the use of Vertin 16 Tablet in patients with liver disease. Please consult your doctor."}, "substitute": {"Vertiford 16mg Tablet": "Leeford Healthcare Ltd", "Artin 16mg Tablet": "Shalman Pharma Pvt Ltd", "Medohist 16mg Tablet": "Medna Biotech Private Limited", "Vertiox 16mg Tablet": "Noxxon Pharmaceuticals Pvt Ltd", "Betlan 16mg Tablet": "Atlantis Formulations Pvt Ltd"}}