{"medicine_name": "Zedex Plus Cough Syrup Sugar Free", "manufacturer": "Dr Reddy's Laboratories Ltd", "composition": ["Phenylephrine (5mg/5ml)", "Chlorpheniramine Maleate (2mg/5ml)", "Dextromethorphan Hydrobromide (10mg/5ml)"], "introduction": ["Zedex Plus Cough Syrup Sugar Free is a combination medicine used in the treatment of dry cough. It relieves allergic symptoms such as sneezing, runny nose, watery eyes, and throat irritation. It also provides relief from congestion or stuffiness in the nose.", "Zedex Plus Cough Syrup Sugar Free is taken with or without food in a dose and duration as advised by the doctor. The dose you are given will depend on your condition and how you respond to the medicine. You should keep taking this medicine for as long as your doctor recommends. If you stop treatment too early your symptoms may come back and your condition may worsen. Let your healthcare team know about all other medications you are taking as some may affect, or be affected by this medicine.", "The most common side effects are nausea, vomiting, loss of appetite, and headache. Most of these are temporary and usually resolve with time. Contact your doctor straight away if you are at all concerned about any of these side effects. This medicine can also cause sleepiness, so do not drive or do anything that requires mental focus until you know how this medicine affects you. Avoid drinking alcohol while taking this medicine as it can worsen your sleepiness.", "Never support self-medication or recommend your medicine to another person. It is beneficial to have plenty of fluids while taking this medication. Before taking this medicine, you should tell your doctor if you are pregnant, planning pregnancy or breastfeeding. You should also tell your doctor if you have any kidney or liver diseases so that your doctor can prescribe a suitable dose for you."], "uses": ["Treatment of Dry cough"], "side_effects": ["Nausea", "Vomiting", "Loss of appetite", "Headache"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Check the label for directions before use. Measure it with a measuring cup and take it by mouth. Shake well before use. Zedex Plus Cough Syrup Sugar Free may be taken with or without food, but it is better to take it at a fixed time.", "safety_advice": {"Alcohol": "Caution is advised when consuming alcohol with Zedex Plus Cough Syrup Sugar Free. Please consult your doctor.", "Pregnancy": "Zedex Plus Cough Syrup Sugar Free may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.", "Breast feeding": "Zedex Plus Cough Syrup Sugar Free is probably safe to use during breastfeeding. Limited human data suggests that the drug does not represent any significant risk to the baby.", "Driving": "Zedex Plus Cough Syrup Sugar Free may cause side effects which could affect your ability to drive.", "Kidney": "Zedex Plus Cough Syrup Sugar Free is probably safe to use in patients with kidney disease. Limited data available suggests that dose adjustment of Zedex Plus Cough Syrup Sugar Free may not be needed in these patients. Please consult your doctor.", "Liver": "Zedex Plus Cough Syrup Sugar Free is probably unsafe to use in patients with liver disease and should be avoided. Please consult your doctor."}, "substitute": {"Alkof Junior Syrup": "Alkem Laboratories Ltd", "Respicure-D Syrup": "Corona Remedies Pvt Ltd", "Chericof Syrup": "Sun Pharmaceutical Industries Ltd", "Ataqued Syrup": "Staunch Health Care Pvt Ltd"}}