{"medicine_name": "Zerodol-SP Tablet", "manufacturer": "Ipca Laboratories Ltd", "composition": ["Aceclofenac (100mg)", "Paracetamol (325mg)", "Serratiopeptidase (15mg)"], "introduction": ["Zerodol-SP Tablet is a combination medicine used to relieve pain and swelling in various conditions like muscle pain, joint pain, and postoperative pain. Thus, it effectively alleviates pain and inflammation in conditions like rheumatoid arthritis, ankylosing spondylitis, and osteoarthritis.", "Zerodol-SP Tablet should be taken in the dose and duration as advised by your doctor. It should be taken with food or milk to prevent stomach upset. Taking the medicine regularly at the right times increases its effectiveness. It is important to keep taking the medicine regularly until your doctor tells you it is safe to stop.", "Nausea, vomiting, stomach pain, indigestion, heartburn, loss of appetite, and diarrhea are some of the common side effects that might be observed on taking this medicine. Your doctor may regularly monitor your kidney function, liver function, and levels of blood components if you are taking this medicine for long-term treatment. Long-term use may lead to serious complications such as stomach bleeding and kidney problems. Zerodol-SP Tablet is not recommended if you are pregnant or breastfeeding."], "uses": ["Pain relief"], "side_effects": ["Nausea", "Vomiting", "Stomach pain", "Indigestion", "Heartburn", "Loss of appetite", "Diarrhea"], "how_to_use": "Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Zerodol-SP Tablet is to be taken with food.", "safety_advice": {"Alcohol": "It is unsafe to consume alcohol with Zerodol-SP Tablet.", "Pregnancy": "Zerodol-SP Tablet may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.", "Breast feeding": "Information regarding the use of Zerodol-SP Tablet during breastfeeding is not available. Please consult your doctor.", "Driving": "Zerodol-SP Tablet may decrease alertness, affect your vision or make you feel sleepy and dizzy. Do not drive if these symptoms occur.", "Kidney": "Zerodol-SP Tablet should be used with caution in patients with kidney disease. Dose adjustment of Zerodol-SP Tablet may be needed. Please consult your doctor.\nUse of Zerodol-SP Tablet is not recommended in patients with severe kidney disease.", "Liver": "Zerodol-SP Tablet should be used with caution in patients with liver disease. Dose adjustment of Zerodol-SP Tablet may be needed. Please consult your doctor.\nHowever, the use of Zerodol-SP Tablet is not recommended in patients with severe liver disease and active liver disease."}, "substitute": {"Vetory SP Tablet": "Hetero Drugs Ltd", "Acimol Forte 100mg/325mg/15mg Tablet": "Leeford Healthcare Ltd", "Ibugesic ASP Tablet": "Cipla Ltd", "Dolokind AA Tablet": "Mankind Pharma Ltd", "Acemiz-S Tablet": "Lupin Ltd"}}